xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
                                /* Log the download complete information */
                                char log_details[LOGDETAILSSIZE];
                                snprintf( log_details, sizeof( log_details ),
                                          "filename=%s revision=%s length = %d", firmware_filename , download_context.file_revision, download_context.file_length );
                                xi_publish_device_log( in_context_handle, "Firmware Update Finished.", log_details, download_context.result );

                                printf( "=================\n");
                                printf( "Done downloading.\n");
                                printf( "   result: %d\n", download_context.result );
                                printf( "=================\n");

                                /* Set the bootloader to test the new image */
                                if( download_context.result )
                                {
                                    printf("NOT MARKING FILE TO TEST DUE TO ERRORS\n");
                                }
                                else
                                {
                                    xi_publish_device_log( in_context_handle, "Rebooting Device to Test Firmware.", "Device will reboot in 3 seconds", sft_status_ok );
                                    sl_extlib_FlcTest( FLC_TEST_RESET_MCU | FLC_TEST_RESET_MCU_WITH_APP );

                                    /* Schedule a callback to reboot the device to test the image
                                     * We don't do this immediately because we want to give enough time
                                     * for our device log publications to send. */
                                    xi_schedule_timed_task( in_context_handle, reboot_mcu, 3, 0, NULL );
                                }
                            }
                            break;
                        default:
                            break;
                    }
                }

            }
            return;
        default:
            return;
    }
}

void
xi_publish_file_info( xi_context_handle_t in_context_handle )
{
    /* Let's try making a XI_FILE_INFO packet */
    cn_cbor_errback err;
    cn_cbor *cb_map = cn_cbor_map_create( &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgtype", &err ),
                     cn_cbor_int_create( XI_FILE_INFO, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create("msgver", &err ),
                     cn_cbor_int_create( 1, &err ), &err );

    cn_cbor *a = cn_cbor_array_create( &err );
    cn_cbor *cb_file1 = cn_cbor_map_create( &err );
    cn_cbor_map_put( cb_file1, cn_cbor_string_create( "N", &err ),
                     cn_cbor_string_create( firmware_filename, &err ), &err );

    cn_cbor_map_put( cb_file1, cn_cbor_string_create( "R", &err ),
                     cn_cbor_string_create( "-1", &err ), &err );

    cn_cbor_array_append( a, cb_file1, &err );
    cn_cbor_map_put( cb_map, cn_cbor_string_create( "list", &err ),
                     a, &err );

    unsigned char encoded[128];
    const ssize_t enc_sz = cn_cbor_encoder_write( encoded, 0, sizeof( encoded ), cb_map );
    cn_cbor_free( cb_map CBOR_CONTEXT_PARAM );

    if( 0 >= enc_sz )
    {
        xi_set_sft_error( sft_cbor_encoding_error );
        xi_publish_device_log_format_int( in_context_handle, "FILE_INFO Encoding Error",
                                          "encoding FILE_INFO cbor error: %d",
                                           enc_sz, sft_cbor_encoding_error );
        return;
    }

    /* publish the FILE_INFO message */
    xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz, XI_MQTT_QOS_AT_MOST_ONCE,
                     XI_MQTT_RETAIN_FALSE, NULL, NULL );
    printf( "Published FILE_INFO to %s\n",xi_stopic );
}


void xi_parse_file_update_available( xi_context_handle_t in_context_handle, cn_cbor *cb)
{
    cn_cbor *cb_list;
    cn_cbor *cb_item;
    cn_cbor *cb_file;
    int filelistlength = 0;
    int i,index;

    /* Zero out download_context */
    memset( &download_context, 0, sizeof( file_download_ctx_t ) );

    /* Initialize sha256 digest of the file and tracking variables */
    sha256_init( &download_context.sha256_context );

    /* check message version */
    cb_item = cn_cbor_mapget_string( cb, "msgver" );
    if( cb_item )
    {
        if( 1 != cb_item->v.uint )
        {
            xi_set_sft_error( sft_unsupported_protocol_version );
            xi_publish_device_log_format_int( in_context_handle, "File update available error",
                                              "FILE_UPDATE_AVAILABLE SFT message version: %d is unsupported",
                                              cb_item->v.uint, sft_unsupported_protocol_version );
            printf("ERROR: Unsupported FILE_UPDATE_AVIALABLE message version: %d\n", cb_item->v.uint );
            return;
        }
    }

    /* Get the File List.  For this demo it should be only one file */
    cb_list = cn_cbor_mapget_string(cb, "list");
    if(cb_list)
    {
        filelistlength = cb_list->length;
    }

    /* iterate over the file list */
    for( index = 0; index < filelistlength; index++ )
    {
        cb_item = cn_cbor_index(cb_list, index);

        if( cb_item )
        {
        	    /* File 'N'ame */
            cb_file = cn_cbor_mapget_string(cb_item, "N");
            if( cb_file )
            {
                if( strlen( firmware_filename ) != cb_file->length ||
                    strncmp( firmware_filename, cb_file->v.str, cb_file->length ) != 0 )
                {
                    xi_set_sft_error( sft_unexpected_filename_error );
                    xi_publish_device_log( in_context_handle, "Unexpected Filename Error",
                                            "Unexpected filename, expected 'firmware'", sft_unexpected_filename_error );
                    printf( "ERROR: incoming file update has an unexpected name. Expected `firmware`" );
                    return;
                }
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE", "N" );
                return;
            }

            /* File 'R'evision */
            cb_file = cn_cbor_mapget_string(cb_item, "R");
            if( cb_file )
            {
                strncpy( download_context.file_revision, cb_file->v.str, sizeof( download_context.file_revision ) );

