xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    /* Ensure that this chunk starts where we left off. */
    if( download_context.file_storage_offset != file_chunk_data.offset )
    {
        printf("ERROR: unexpected Chunk Offset Delivered by SFT!\n");
        xi_set_sft_error( sft_file_data_offset_error );
        xi_publish_device_log_format_int_int( in_context_handle, "File Chunk Offset Error",
                                          "Expected offset: %d but recieved offset: %d",
                                          download_context.file_storage_offset, file_chunk_data.offset, sft_file_data_offset_error );
        return;
    }

    /* Track Progress */
    if( currenttenpercent < file_chunk_data.offset )
    {
        printf("Downloaded %d bytes %d %%  of the file \n", download_context.file_storage_offset,
                 (100 * (currenttenpercent + 1000) ) / download_context.file_length );
        currenttenpercent += tenpercent;
    }

    /* Ensure that we have a buffer to write from */
    if( 0 == file_chunk_data.array_length )
    {
        printf( "ERROR: FILE_CHUNK cbor message has zero length byte array\n" );
        xi_set_sft_error( sft_empty_length_array_error );
        xi_publish_device_log( in_context_handle, "File Chunk Data Error",
                               "FILE_CHUNK message from SFT has a zero length data array.",
                               sft_empty_length_array_error );
        return;
    }

    /* convert from unsigned to signed becuase TI's API has a signed length variable */
    if( file_chunk_data.offset + file_chunk_data.array_length > download_context.file_length )
    {
        printf( "ERROR: Chunk offset + length extends beyond length of file\n" );
        xi_set_sft_error( sft_file_data_offset_error );
        xi_publish_device_log_format_int_int( in_context_handle, "File Chunk Offset Error",
                                              "Offset: %d length: %d goes beyond bounds of file length.",
                                              file_chunk_data.offset + file_chunk_data.array_length,
                                              download_context.file_length, sft_file_data_offset_error );
        return;
    }

    int write_length = (int) file_chunk_data.array_length;
    if( 0 == write_length )
    {
        printf( "ERROR: FILE_CHUNK zero length data array\n" );
        xi_set_sft_error( sft_empty_length_array_error );
        xi_publish_device_log( in_context_handle, "File Chunk Write Error",
                               "Casting file chunk array length is zero", sft_empty_length_array_error );
        return;
    }

    if( 0 > write_length )
    {
        /* Negative values means that we lost data in the unsigned -> signed conversion. */
        printf("ERROR: WriteBuffer is too large for CC3200 sl_extlib_FlcWriteFile operations\n");
        xi_set_sft_error( sft_write_error );
        xi_publish_device_log( in_context_handle, "File Chunk Write Error",
                               "WriteBuffer is too large for CC3200 sl_extlib_FlcWriteFile operations", sft_write_error );
        return;
    }

    int bytes_written = sl_extlib_FlcWriteFile( download_context.file_handle, file_chunk_data.offset,
                                                (unsigned char *) file_chunk_data.byte_array, write_length );
    if( 0 >= bytes_written )
    {
        printf( "ERROR: sl_extlib_FlcWriteFile returned error code: %d\n", bytes_written );
        xi_set_sft_error( sft_write_error );
        xi_publish_device_log_format_int( in_context_handle, "File Write Error",
                                          "l_extlib_FlcWriteFile returned error code: %d.",
                                          bytes_written, sft_write_error );
        return;
    }
    else
    {
        /* update the SHA256 digest with the provided data */
        sha256_update( &download_context.sha256_context, (unsigned char *) file_chunk_data.byte_array, bytes_written );

        /* Track our progress through the file */
        download_context.file_storage_offset = file_chunk_data.offset + bytes_written;

        /* Check for completeness */
        if( download_context.file_storage_offset >= download_context.file_length )
        {
            /* Download Complete */
            downloading = 0;
            xi_publish_device_log( in_context_handle, "File download is complete",
                                  "Downloaded and Written full file: firmware", sft_status_ok );
        }
    }

    if( 1 < file_chunk_data.status )
    {
        printf("ERROR: SFT packet reported Chunk Status Request Error: %d\n", file_chunk_data.status );
        xi_set_sft_error( sft_cbor_error_field_set_error );
        xi_publish_device_log_format_int( in_context_handle, "File Chunk Status Error",
                                          "FILE_CHUNK status CBOR field contains an error status: %d",
                                          file_chunk_data.status, sft_cbor_error_field_set_error );
    }

    if( 1 == downloading )
    {
        /* If still download  continuing, create another FILE_CHUNK request to the SFT service */
        xi_publish_file_chunk_request( in_context_handle, firmware_filename,
                                           download_context.file_revision, download_context.file_storage_offset );
    }
}

/* Parses the CBOR message to get the FILE_CHUNK required FILE_CHUNK fields
 * and places the data in the out_sft_file_chunk structure
 * Returns 0 on success, or -1 if there are missing fields or null parameters
 */
void xi_parse_file_chunk( xi_context_handle_t in_context_handle, cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk )
{
    if( NULL == in_cb || NULL == out_sft_file_chunk )
    {
        xi_set_sft_error( sft_internal_error );
        xi_publish_device_log( in_context_handle, "Internal Error",
                                   "xi_parse_file_chunk null pointer parameter",
                                   sft_internal_error );
    }

    /* use the RED LED to signal downloading progress */
    static int ledToggle = 0;
    ledToggle = ( ledToggle + 1 ) % 2;
    if( ledToggle )
    {
        GPIO_IF_LedOn( MCU_RED_LED_GPIO );
    }
    else
    {
        GPIO_IF_LedOff( MCU_RED_LED_GPIO );
    }

    cn_cbor *cb_item = NULL;
    memset( out_sft_file_chunk, 0, sizeof( xi_sft_file_chunk_t ) );

    /* msg version */
    cb_item = cn_cbor_mapget_string( in_cb, "msgver" );
    if(cb_item)
    {
        if( 1 != cb_item->v.uint )
        {
            printf( "ERROR: Unsupported FILE_CHUNK message version: %d\n", cb_item->v.uint );
            xi_set_sft_error( sft_unsupported_protocol_version );
            xi_publish_device_log_format_int( in_context_handle, "FILE_CHUNK error",
                                              "FILE_CHUNK Packet version: %d is unsupported",
                                              cb_item->v.uint, sft_unsupported_protocol_version );
            return;
        }
    }
    else
    {
       xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "msgver" );
       return;
    }

    /* chunk offset */
    cb_item = cn_cbor_mapget_string( in_cb, "O" );
    if( cb_item )
    {
       out_sft_file_chunk->offset = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "O" );
        return;
    }

