xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    /* chunk length */
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "L" );
        return;
    }

    /* Status */
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "S" );
        return;
    }

    /* Byte Array */
    cb_item = cn_cbor_mapget_string( in_cb, "C" );
    if(cb_item)
    {
        out_sft_file_chunk->array_length = cb_item->length;
        out_sft_file_chunk->byte_array = (unsigned char *)cb_item->v.str;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "C" );
        return;
    }
}


/* Invoked when file download is complete.
 * Converts the locally computed hash into a string
 * and compares it to the SFT hash string 'fingerprint'
 * that we received during the FILE_UPDATE_AVAILABLE message.
 * Reports an error to Device Logs if there's a mis match,
 * and marks the error state.
 */
void verify_sha256( xi_context_handle_t in_context_handle )
{
    /* Finalize SHA256 Digest */
    sha256_final( &download_context.sha256_context, download_context.file_local_computed_fingerprint );
    printf( "Calculated hash = 0x" );
    print_hash( download_context.file_local_computed_fingerprint );

    char local_fingerprint_str[65];
    char* buff_ptr = local_fingerprint_str;

    /* convert binary to a string matching SFT fingprint format */
    int i;
    for( i = 0; i < 32; ++i )
    {
        buff_ptr += sprintf( buff_ptr, "%02x", download_context.file_local_computed_fingerprint[i] );
    }

    /* null terminate the string */
    *buff_ptr = '\0';

    /* are they the same? If not then raise the red flag */
    if( 0 != strncmp( local_fingerprint_str, download_context.file_sft_fingerprint_str, 64 ) )
    {
        printf("File Update Fingerprint mismatch.  SFT Fingerprint: %s  device-calculated fingerprint: %s\n",
               download_context.file_sft_fingerprint_str, local_fingerprint_str );
        xi_set_sft_error( sft_fingerprint_mismatch_error );
        xi_publish_device_log_format_str_str( in_context_handle, "File Update Fingerprint Mismatch",
                                              "sft fingerprint: %s device-calculated fingerprint: %s ",
                                              download_context.file_sft_fingerprint_str, local_fingerprint_str,
                                              sft_fingerprint_mismatch_error );
        return;
    }
}

/*
 * Error Handling functions
 */
void xi_set_sft_error( sft_status_t status )
{
    downloading = 0;
    download_context.result = status;
}

void xi_missing_cbor_field_error( xi_context_handle_t in_context_handle,
                                       const char* cbor_message_name, const char* field_name )
{
    xi_set_sft_error( sft_cbor_missing_field_error );

    if( NULL == cbor_message_name || NULL == field_name )
    {
        printf( "ERROR: invalid parameter passed to missing_cbor_field_error\n" );
        return;
    }

    printf("ERROR: SFT Message: %s missing CBOR field: %s\n", cbor_message_name, field_name );

    /* Send to Device Logs */
    char log_details_str[LOGDETAILSSIZE];
    snprintf( log_details_str, sizeof( log_details_str ),
              "SFT Message: %s missing CBOR field: %s", cbor_message_name, field_name );

    xi_publish_device_log( in_context_handle, "File update available error",
                        log_details_str, sft_cbor_missing_field_error );
}

/*
 * Device Log Functions
 * Note: Device log entires appear in the 'Logs' tab in Xively CPM's Device Details page of your
 * particular Xively provisioned device.
 */

void xi_publish_device_log( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str, const sft_status_t status )
{
    /* Formats a message in the correct Xively Device Logs format and publishes it
     * to the device logs topic. Note that, due to the asynchronous behavior
     * of the client for the platform, this requires a few Xively ticks before
     * sending, so don't reboot immediately following a logged error! */

    if( NULL == message_str || NULL == details_str )
    {
        printf("\nWarning: xi_publish_device_log invoked with a null string parameter\n");
        return;
    }
    else if( sft_status_max <= status )
    {
        printf("\nWarning: xi_publish_device_log invoked with an invalid status parametern");
        return;
    }

    char* severity_str = "";
    switch( status )
    {
    case sft_status_rebooting:
        severity_str = "alert";
        break;
    case sft_status_ok:
        severity_str = "notice";
        break;
    default:
        severity_str = "error";
        break;
    }

    char device_log_buffer[400];
    snprintf( device_log_buffer, sizeof(device_log_buffer),
                  "{\"message\":\"%s\",\"severity\":\"%s\",\"code\":\"%d\",\"details\":\"%s: %s\"}",
                  message_str, severity_str, status, sft_status_strings[ status ], details_str );

    xi_publish( in_context_handle, xi_logtopic, device_log_buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
}

void xi_publish_device_log_format_int( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str,
                                  const int value_int, const sft_status_t status )
{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_int );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}

void xi_publish_device_log_format_int_int( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str,
                                      const int value_int1, const int value_int2, const sft_status_t status )
{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_int1, value_int2 );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}


void xi_publish_device_log_format_str( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str,
                                  const char* value_str, const sft_status_t status )
{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_str );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}

void xi_publish_device_log_format_str_str( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str,
                                      const char* value_str1, const char* value_str2, const sft_status_t status )

{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_str1, value_str2 );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}


/* Functions useful for debugging */
void print_hash( unsigned char hash[] )
{
   int idx;
   for ( idx=0; idx < 32; idx++ )
   {
      printf( "%02x",hash[idx] );
   }
   printf( "\n" );
}

#ifdef XI_DEBUGSFT
void dump(const cn_cbor* cb, char* out, char** end, int indent) {
    int i;
    cn_cbor* cp;
    char finchar = ')';           /* most likely */

#define CPY(s, l) memcpy(out, s, l); out += l;
#define OUT(s) CPY(s, sizeof(s)-1)
#define PRF(f, a) out += sprintf(out, f, a)

    if (!cb)
        goto done;

    for (i = 0; i < indent; i++) *out++ = ' ';
    switch (cb->type) {
        case CN_CBOR_TEXT_CHUNKED:   OUT("(_\n");                  goto sequence;
        case CN_CBOR_BYTES_CHUNKED:  OUT("(_\n\n");                goto sequence;
        case CN_CBOR_TAG:            PRF("%ld(\n", cb->v.sint);    goto sequence;
        case CN_CBOR_ARRAY:  finchar = ']'; OUT("[\n");            goto sequence;
        case CN_CBOR_MAP:    finchar = '}'; OUT("{\n");            goto sequence;
        sequence:
            for (cp = cb->first_child; cp; cp = cp->next) {
                dump(cp, out, &out, indent+2);
            }
            for (i=0; i<indent; i++) *out++ = ' ';
            *out++ = finchar;
            break;
        case CN_CBOR_BYTES:   OUT("h'\n");
            for (i=0; i<cb->length; i++) {
                PRF("%02x ", cb->v.str[i] & 0xff);
            }

            *out++ = '\'';
            break;
        case CN_CBOR_TEXT:    *out++ = '"';
            CPY(cb->v.str, cb->length); /* should escape stuff */
            *out++ = '"';
            break;
        case CN_CBOR_NULL:   OUT("null");                      break;
        case CN_CBOR_TRUE:   OUT("true");                      break;
        case CN_CBOR_FALSE:  OUT("false");                     break;
        case CN_CBOR_UNDEF:  OUT("simple(23)");                break;
        case CN_CBOR_INT:    PRF("%ld", cb->v.sint);           break;
        case CN_CBOR_UINT:   PRF("%lu", cb->v.uint);           break;
        case CN_CBOR_DOUBLE: PRF("%e", cb->v.dbl);             break;
        case CN_CBOR_SIMPLE: PRF("simple(%ld)", cb->v.sint);   break;
        default:             PRF("???%d???", cb->type);        break;
    }
    *out++ = '\n';
done:
    *end = out;
}
#endif
